app/views/vendors/decline.html.erb

SELECT "vendors".* FROM "vendors" WHERE "vendors"."id" = ? LIMIT 1  [["id", "1"]]
---

<%= Vendor.find(params[:vendor_id]).name%>