app/views/vendors/finish_transaction.html.erb

    <%= label_tag(:vendor_name, "Vendor name :") %>
    <%= label_tag(:vendor_name,  Vendor.find(@booking.vendor_id).name)%>
---
SELECT "vendors".* FROM "vendors" WHERE "vendors"."id" = ? LIMIT 1  [["id", 1]]

	<%= label_tag( :customer_name,"Customer name :") %>
    <%= label_tag( :customer_name, Customer.find(@booking.customer_id).name)%>
---
SELECT "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT 1  [["id", 5]]