app/views/vendors/show.html.erb

SELECT "vendors".* FROM "vendors" WHERE "vendors"."id" = ? LIMIT 1  [["id", "1"]]
---
  <b> Vendor name:</b>
  <%= Vendor.find(transaction.vendor_id).name %>