app/controllers/bookings_controller.rb

SELECT "vendors_zones".* FROM "vendors_zones" WHERE "vendors_zones"."zone_id" = 7 ORDER BY numberOfOrders ASC LIMIT 1
UPDATE "vendors_zones" SET "numberOfOrders" = 1, "updated_at" = '2018-07-11 11:17:44.283827' WHERE "vendors_zones"."id" = 2
---
  def create
    @booking = Booking.new(params[:booking])

      @booking.customer_id=$customerId

      @customer=Customer.find($customerId)
      @vendors=VendorsZones.where(zone_id: @customer.zone).order('numberOfOrders ASC').first
      #########################################################################################
      @vendors.numberOfOrders=@vendors.numberOfOrders+1
      @vendors.update_attribute(:numberOfOrders, @vendors.numberOfOrders)