app/controllers/bookings_controller.rb

SELECT "bookings".* FROM "bookings" WHERE "bookings"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @booking = Booking.find(params[:id])

SELECT "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT 1  [["id", "5"]]
SELECT "vendors_wards".* FROM "vendors_wards" WHERE "vendors_wards"."ward" = 7 ORDER BY numberOfOrders AESC LIMIT 1
UPDATE "vendors_wards" SET "numberOfOrders" = 1, "updated_at" = '2018-07-09 10:28:25.450352' WHERE "vendors_wards"."id" = 2
INSERT INTO "bookings" ("bookingTime", "brandId", "brandName", "created_at", "customerId", "otp", "price", "updated_at", "vendorId") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @booking = Booking.new(params[:booking])

      @booking.customerId=$customerId

      @customer=Customer.find($customerId)
      @vendors=VendorsWard.where(ward: @customer.ward).order('numberOfOrders ASC').first
      @vendors.numberOfOrders=@vendors.numberOfOrders+1
      @vendors.update_attribute(:numberOfOrders, @vendors.numberOfOrders)
      @booking.vendorId=@vendors.vendor_id

   @booking.bookingTime=Time.now
      @booking.otp=rand.to_s[2..6]

      case @booking.brandName
          when "Bisleri"
            @booking.brandId=1
            @booking.price=@booking.price*200
          when "Kenley"
            @booking.brandId=2
            @booking.price=@booking.price*208
          when "TATA"
            @booking.brandId=3
            @booking.price=@booking.price*210
          when "Vendor brand"
            @booking.brandId=4
            @booking.price=@booking.price*150
      end

    respond_to do |format|
      if @booking.save

SELECT "bookings".* FROM "bookings" WHERE "bookings"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "bookings" WHERE "bookings"."id" = ?  [["id", 1]]
---
  def destroy
    @booking = Booking.find(params[:id])
    @booking.destroy