app/controllers/customers_controller.rb

 def findId
     username=params[:username]
     password=params[:password]
     @customer = Customer.find{ |x| x.name == username && x.password == password }
---
SELECT "customers".* FROM "customers"

  def create
    @customer = Customer.new(params[:customer])
    pincode=@customer.ward
    zone=0
    case pincode
    when 600019 then zone=1
    when 600068 then zone=2
    when 600060 then zone=3
    when 600039 then zone=4
    when 600021 then zone=5
    when 600011 then zone=6
    when 600037 then zone=7
    when 600040 then zone=8
    when 600018 then zone=9
    when 600017 then zone=10
    when 600116 then zone=11
    when 600016 then zone=12
    when 600020 then zone=13
    when 600041 then zone=14
    when 600119 then zone=15
    end
    @customer.ward=zone
      respond_to do |format|
      if @customer.save
---
INSERT INTO "customers" ("address", "created_at", "email", "name", "password", "updated_at", "ward") VALUES (?, ?, ?, ?, ?, ?, ?)  [["address", "a"], ["created_at", Sat, 07 Jul 2018 08:25:16 UTC +00:00], ["email", "a"], ["name", "a"], ["password", "a"], ["updated_at", Sat, 07 Jul 2018 08:25:16 UTC +00:00], ["ward", 1]]

  def update
    @customer = Customer.find(params[:id])

    respond_to do |format|
      if @customer.update_attributes(params[:customer])
---
SELECT "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "customers" SET "name" = 'devi', "password" = 'devi', "address" = '', "ward" = 0, "email" = 'thirumladevi.sivakumar@freshworks.com', "updated_at" = '2018-07-07 09:57:55.369065' WHERE "customers"."id" = 6

  def destroy
    @customer = Customer.find(params[:id])
    @customer.destroy
---
SELECT "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "customers" WHERE "customers"."id" = ?  [["id", 1]]