app/controllers/vendors_wards_controller.rb

  def index
    @vendors_wards = VendorsWard.all
---
SELECT "vendors_wards".* FROM "vendors_wards"

  def show
    @vendors_ward = VendorsWard.find(params[:id])
---
SELECT "vendors_wards".* FROM "vendors_wards" WHERE "vendors_wards"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @vendors_ward = VendorsWard.find(params[:id])
---
SELECT "vendors_wards".* FROM "vendors_wards" WHERE "vendors_wards"."id" = ? LIMIT 1  [["id", "2"]]

  def create
    @vendors_ward = VendorsWard.new(params[:vendors_ward])

    respond_to do |format|
      if @vendors_ward.save
---
INSERT INTO "vendors_wards" ("created_at", "customer_id", "numberOfOrders", "updated_at", "vendor_id", "ward") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Mon, 09 Jul 2018 09:46:35 UTC +00:00], ["customer_id", 24], ["numberOfOrders", 0], ["updated_at", Mon, 09 Jul 2018 09:46:35 UTC +00:00], ["vendor_id", 1], ["ward", 1]]

  def update
    @vendors_ward = VendorsWard.find(params[:id])

    respond_to do |format|
      if @vendors_ward.update_attributes(params[:vendors_ward])
---
SELECT "vendors_wards".* FROM "vendors_wards" WHERE "vendors_wards"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "vendors_wards" SET "numberOfOrders" = 0, "updated_at" = '2018-07-09 13:59:50.095310' WHERE "vendors_wards"."id" = 2

  def destroy
    @vendors_ward = VendorsWard.find(params[:id])
    @vendors_ward.destroy
---
SELECT "vendors_wards".* FROM "vendors_wards" WHERE "vendors_wards"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "vendors_wards" WHERE "vendors_wards"."id" = ?  [["id", 1]]