app/controllers/vendors_controller.rb

  def show
    @vendor = Vendor.find(params[:id])
    @transactions = []
    @vendor.bookings.each do |temp|
---
SELECT "vendors".* FROM "vendors" WHERE "vendors"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "bookings".* FROM "bookings" WHERE "bookings"."vendor_id" = 1

  def login_check
    @vend = Vendor.find{|temp| temp.name == params[:name] && temp.password == params[:password]}
---
SELECT "vendors".* FROM "vendors"

  def new_booking
    @vendor = Vendor.find(params[:id])
---
SELECT "vendors".* FROM "vendors" WHERE "vendors"."id" = ? LIMIT 1  [["id", "1"]]

  def finish_transaction
    @booking = Booking.find(params[:id])
---
SELECT "bookings".* FROM "bookings" WHERE "bookings"."id" = ? LIMIT 1  [["id", "1"]]

  def accept
     @transaction = Booking.find(params[:id])
     @transaction.accepted = true
     @transaction.save
---
SELECT "bookings".* FROM "bookings" WHERE "bookings"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "bookings" SET "accepted" = 't', "updated_at" = '2018-07-11 12:47:05.285640' WHERE "bookings"."id" = 1

  def decline
    transaction_to_change = Booking.find(params[:id])
    vendor_who_cancel = Vendor.find(params[:vendor_id])
    @vendors_two=VendorsZones.where(zone_id: Customer.find(transaction_to_change.customer_id).zone ).order('numberOfOrders ASC').first(2)
    vendor_zone = (vendor_who_cancel.id == @vendors_two[0].vendor_id ? @vendors_two[1] : @vendors_two[0])
    vendor_zone.numberOfOrders = vendor_zone.numberOfOrders.to_i + 1
    vendor_zone.save
    vendor_cancel_zone = VendorsZones.find(vendor_who_cancel.id)
    vendor_cancel_zone.numberOfOrders = vendor_cancel_zone.numberOfOrders.to_i - 1
    vendor_cancel_zone.save
    transaction_to_change.vendor_id = Vendor.find(vendor_zone.vendor_id).id
    transaction_to_change.save
---
SELECT "bookings".* FROM "bookings" WHERE "bookings"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "vendors".* FROM "vendors" WHERE "vendors"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "vendors_zones".* FROM "vendors_zones" WHERE "vendors_zones"."zone_id" = 7 ORDER BY numberOfOrders ASC LIMIT 2
SELECT "vendors_zones".* FROM "vendors_zones" WHERE "vendors_zones"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "vendors_zones" SET "numberOfOrders" = -1, "updated_at" = '2018-07-15 05:39:42.319692' WHERE "vendors_zones"."id" = 2
SELECT "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT 1  [["id", 5]]
UPDATE "bookings" SET "vendor_id" = 2, "updated_at" = '2018-07-16 05:50:59.487751' WHERE "bookings"."id" = 4

  def create
    @vendor = Vendor.create()
    @vendor.name = params[:name]
    @vendor.password = params[:password]
    @vendor.address = params[:address]
    @vendor.vend_type = params[:vend_type]
    @vendor.save
    params[:location].each do |loc|
      VendorsZones.create(vendor_id: @vendor.id, zone_id: Zone.find(|temp| temp.name == loc))
---
INSERT INTO "vendors" ("address", "created_at", "name", "password", "updated_at", "vend_type") VALUES (?, ?, ?, ?, ?, ?)  [["address", nil], ["created_at", Mon, 16 Jul 2018 11:55:14 UTC +00:00], ["name", nil], ["password", nil], ["updated_at", Mon, 16 Jul 2018 11:55:14 UTC +00:00], ["vend_type", nil]]
UPDATE "vendors" SET "name" = 'twr', "password" = 'pass2', "address" = 'sfd', "vend_type" = 't', "updated_at" = '2018-07-16 11:55:14.927273' WHERE "vendors"."id" = 3
INSERT INTO "vendors_zones" ("created_at", "numberOfOrders", "updated_at", "vendor_id", "zone_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Mon, 16 Jul 2018 12:00:37 UTC +00:00], ["numberOfOrders", 0], ["updated_at", Mon, 16 Jul 2018 12:00:37 UTC +00:00], ["vendor_id", 6], ["zone_id", nil]]
SELECT "zones".* FROM "zones" WHERE "zones"."name" = 'thiruvottiyur' LIMIT 1

  def submit_otp
    @new_otp = params[:otp]
    @transaction = Booking.find(params[:booking_id])
    if @transaction.otp == @new_otp.to_i
      @transaction.destroy #Booking.find(@transaction.id).destroy , Booking.destroy(@transaction.id)
---
SELECT "bookings".* FROM "bookings" WHERE "bookings"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "bookings" WHERE "bookings"."id" = ?  [["id", 1]]